Задача 1
--------
Дана порождающая матрица

$$
G = \left[\begin{array}{}
1 & 1 & 0 & 1 & 0 \\
0 & 1 & 1 & 0 & 1 \\
1 & 0 & 1 & 1 & 0 \\
\end{array}
\right]
$$
- Построить проверочную матрицу
- Определить все характеристики кода
- Построить таблицу для синдромного декодирования

--------

### Приведение матрицы G к систематическому виду

Работаем над полем $$GF(2)$$. Выполняем элементарные преобразования строк.

Прибавим первую строку к третьей:

$$
\begin{pmatrix}
1&1&0&1&0\\
0&1&1&0&1\\
1&0&1&1&0
\end{pmatrix}
\rightarrow
\begin{pmatrix}
1&1&0&1&0\\
0&1&1&0&1\\
0&1&1&0&0
\end{pmatrix}
$$

Прибавим вторую строку к третьей:

$$
\rightarrow
\begin{pmatrix}
1&1&0&1&0\\
0&1&1&0&1\\
0&0&0&0&1
\end{pmatrix}
$$

Поменяем вторую и третью строки местами:

$$
\rightarrow
\begin{pmatrix}
1&1&0&1&0\\
0&0&0&0&1\\
0&1&1&0&1
\end{pmatrix}
$$

Занулим второй столбец первой строки (прибавим третью строку к первой):

$$
\rightarrow
\begin{pmatrix}
1&0&1&1&1\\
0&0&0&0&1\\
0&1&1&0&1
\end{pmatrix}
$$

Поменяем вторую и третью строки:

$$
\rightarrow
\begin{pmatrix}
1&0&1&1&1\\
0&1&1&0&1\\
0&0&0&0&1
\end{pmatrix}
$$

Переставим строки так, чтобы единичная подматрица была слева, затем занулим третий столбец первой и второй строк:

$$
\rightarrow
\begin{pmatrix}
1&0&0&1&1\\
0&1&0&1&0\\
0&0&1&0&0
\end{pmatrix}
$$

Получили систематический вид матрицы $$G$$:

$$
G=(I_3\mid P)
$$

где

$$
P=
\begin{pmatrix}
1&1\\
1&0\\
0&0
\end{pmatrix}.
$$


### Построение проверочной матрицы

Для систематического вида выполняется

$$
H_{sys}=(P^T\mid I_{n-k}).
$$

Тогда

$$
P^T=
\begin{pmatrix}
1&1&0\\
1&0&0
\end{pmatrix},
\qquad
I_2=
\begin{pmatrix}
1&0\\
0&1
\end{pmatrix}.
$$

Следовательно,

$$
H_{sys}=
\begin{pmatrix}
1&1&0&1&0\\
1&0&0&0&1
\end{pmatrix}.
$$

Возвращая исходный порядок координат, получаем

$$
H_{sys}=
\begin{pmatrix}
1&1&1&0&0\\
1&0&0&1&0
\end{pmatrix}.
$$


### Характеристики кода

Из матрицы $$G$$:

- длина кода $$n=5$$;
- размерность $$k=3$$;
- число кодовых слов $$2^k=8$$;
- скорость кода
  
$$
R=\frac{k}{n}=\frac{3}{5}.
$$

### Минимальное расстояние

Сумма строк порождающей матрицы также является кодовым словом:

$$
11010+01101+10110.
$$

Выполняя сложение по модулю 2:

$$
10101+10110=00001.
$$

Вес полученного кодового слова равен 1, следовательно

$$
d_{min}=1.
$$

Корректирующая способность:

$$
t\le\left\lfloor\frac{d_{min}-1}{2}\right\rfloor=0.
$$

Код не исправляет ошибок.


### Таблица синдромов

Синдром определяется формулой

$$
s(e)=H_{sys}e^T.
$$

Перебираем все возможные векторы ошибки.

| Ошибка e | Синдром s(e) |
|----------|--------------|
|00000|00|
|00001|00|
|00010|01|
|00011|01|
|00100|10|
|00101|10|
|00110|11|
|00111|11|
|01000|10|
|01001|10|
|01010|11|
|01011|11|
|01100|00|
|01101|00|
|01110|01|
|01111|01|
|10000|11|
|10001|11|
|10010|10|
|10011|10|
|10100|01|
|10101|01|
|10110|00|
|10111|00|
|11000|01|
|11001|01|
|11010|00|
|11011|00|
|11100|11|
|11101|11|
|11110|10|
|11111|10|


### Таблица синдромного декодирования

Выбираем в каждом классе синдромов ошибку минимального веса.

| s | e |
|---|---|
|00|00000|
|01|00010|
|10|01000|
|11|10000|

Задача 2
--------

Для двоичного кода Голея (23,12) определите минимальное расстояние и докажите, что код достигает границы Хэмминга.

--------

### Определение минимального расстояния

Минимальное расстояние линейного кода определяется как минимальный вес ненулевого кодового слова:

$$
d_{min}=\min_{c\neq0}\omega(c).
$$

Кодовые слова имеют вид

$$
c=uG,
$$

где $$u$$ — информационный вектор длины $$k=12$$.

Для нахождения минимального расстояния перебираем все ненулевые информационные слова и вычисляем веса соответствующих кодовых слов.

Программа вычисления:

```python
import numpy as np


def weight(vec: np.ndarray) -> int:
    return int(np.sum(vec % 2))


def compute_min_distance(G: np.ndarray) -> int:
    k, n = G.shape
    best = n + 1

    for mask in range(1, 2**k):
        u = np.zeros(k, dtype=int)

        for i in range(k):
            if (mask >> i) & 1:
                u[i] = 1

        codeword = (u.dot(G)) % 2
        w = weight(codeword)

        if w != 0 and w < best:
            best = w

    return best


if __name__ == "__main__":
    G = np.array([
        [1,0,1,0,1,1,1,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0],
        [0,1,0,1,0,1,1,1,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,0,1,0,1,0,1,1,1,0,0,0,1,1,0,0,0,0,0,0,0,0,0],
        [0,0,0,1,0,1,0,1,1,1,0,0,0,1,1,0,0,0,0,0,0,0,0],
        [0,0,0,0,1,0,1,0,1,1,1,0,0,0,1,1,0,0,0,0,0,0,0],
        [0,0,0,0,0,1,0,1,0,1,1,1,0,0,0,1,1,0,0,0,0,0,0],
        [0,0,0,0,0,0,1,0,1,0,1,1,1,0,0,0,1,1,0,0,0,0,0],
        [0,0,0,0,0,0,0,1,0,1,0,1,1,1,0,0,0,1,1,0,0,0,0],
        [0,0,0,0,0,0,0,0,1,0,1,0,1,1,1,0,0,0,1,1,0,0,0],
        [0,0,0,0,0,0,0,0,0,1,0,1,0,1,1,1,0,0,0,1,1,0,0],
        [0,0,0,0,0,0,0,0,0,0,1,0,1,0,1,1,1,0,0,0,1,1,0],
        [0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,1,1,1,0,0,0,1,1]
    ], dtype=int)

    d_min = compute_min_distance(G)
    print("Минимальное расстояние кода:", d_min)

```

В результате выполнения программы получаем:

$$
d_{min}=7.
$$


### Проверка достижения границы Хэмминга

Число кодовых слов:

$$
M=2^k=2^{12}.
$$

Связь минимального расстояния и числа исправляемых ошибок:

$$
d_{min}\ge 2t+1.
$$

Подставляя $$d_{min}=7$$:

$$
7\ge 2t+1 \Rightarrow t=3.
$$

Вычислим объём шара Хэмминга радиуса $$t=3$$:

$$
\sum_{i=0}^{t} C_n^i (2-1)^i = \sum_{i=0}^{3} C_{23}^i.
$$

Вычисляем сумму:

$$
C_{23}^0 + C_{23}^1 + C_{23}^2 + C_{23}^3
= 1 + 23 + \frac{23\cdot22}{2} + \frac{23\cdot22\cdot21}{6}.
$$

$$
= 1 + 23 + 253 + 1771 = 2048 = 2^{11}.
$$

Проверяем границу Хэмминга:

$$
\frac{2^{23}}{2^{11}} = 2^{12} = M.
$$

Получено равенство, следовательно двоичный код Голея (23,12) достигает границы Хэмминга.

